<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"d239e9cb7d1cc7653161749a4a9e83f6b7c08fa50fce7b1be46a6eb9a40ca5c6","plan_job_ref":"Job Test plan target and replace #335 at https://github.com/dflook/terraform-github-actions/actions/runs/5293226573","plan_hash":"1b59e2eaa57afaf0fe3b33510629c2e150ebdc46657541dc3039f14f2ae02c50","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "EbKfoLOZQD" -> (known after apply)
  ~ foreach = "Uvy7RoZKKp" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #335](https://github.com/dflook/terraform-github-actions/actions/runs/5293226573)